; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city9)
	(= (capacity plane1) 12108)
	(= (fuel plane1) 2098)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city2)
	(= (capacity plane2) 7979)
	(= (fuel plane2) 2520)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at plane3 city3)
	(= (capacity plane3) 5421)
	(= (fuel plane3) 1030)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 5)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 4)
	(at person1 city9)
	(at person2 city8)
	(at person3 city7)
	(at person4 city9)
	(at person5 city0)
	(at person6 city7)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 829)
	(= (distance city0 city2) 567)
	(= (distance city0 city3) 576)
	(= (distance city0 city4) 561)
	(= (distance city0 city5) 848)
	(= (distance city0 city6) 719)
	(= (distance city0 city7) 862)
	(= (distance city0 city8) 720)
	(= (distance city0 city9) 860)
	(= (distance city1 city0) 829)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 629)
	(= (distance city1 city3) 862)
	(= (distance city1 city4) 669)
	(= (distance city1 city5) 650)
	(= (distance city1 city6) 681)
	(= (distance city1 city7) 617)
	(= (distance city1 city8) 685)
	(= (distance city1 city9) 930)
	(= (distance city2 city0) 567)
	(= (distance city2 city1) 629)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 794)
	(= (distance city2 city4) 585)
	(= (distance city2 city5) 660)
	(= (distance city2 city6) 699)
	(= (distance city2 city7) 829)
	(= (distance city2 city8) 959)
	(= (distance city2 city9) 977)
	(= (distance city3 city0) 576)
	(= (distance city3 city1) 862)
	(= (distance city3 city2) 794)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 817)
	(= (distance city3 city5) 686)
	(= (distance city3 city6) 793)
	(= (distance city3 city7) 850)
	(= (distance city3 city8) 958)
	(= (distance city3 city9) 691)
	(= (distance city4 city0) 561)
	(= (distance city4 city1) 669)
	(= (distance city4 city2) 585)
	(= (distance city4 city3) 817)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 520)
	(= (distance city4 city6) 788)
	(= (distance city4 city7) 758)
	(= (distance city4 city8) 596)
	(= (distance city4 city9) 849)
	(= (distance city5 city0) 848)
	(= (distance city5 city1) 650)
	(= (distance city5 city2) 660)
	(= (distance city5 city3) 686)
	(= (distance city5 city4) 520)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 607)
	(= (distance city5 city7) 815)
	(= (distance city5 city8) 711)
	(= (distance city5 city9) 827)
	(= (distance city6 city0) 719)
	(= (distance city6 city1) 681)
	(= (distance city6 city2) 699)
	(= (distance city6 city3) 793)
	(= (distance city6 city4) 788)
	(= (distance city6 city5) 607)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 676)
	(= (distance city6 city8) 840)
	(= (distance city6 city9) 690)
	(= (distance city7 city0) 862)
	(= (distance city7 city1) 617)
	(= (distance city7 city2) 829)
	(= (distance city7 city3) 850)
	(= (distance city7 city4) 758)
	(= (distance city7 city5) 815)
	(= (distance city7 city6) 676)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 845)
	(= (distance city7 city9) 991)
	(= (distance city8 city0) 720)
	(= (distance city8 city1) 685)
	(= (distance city8 city2) 959)
	(= (distance city8 city3) 958)
	(= (distance city8 city4) 596)
	(= (distance city8 city5) 711)
	(= (distance city8 city6) 840)
	(= (distance city8 city7) 845)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 872)
	(= (distance city9 city0) 860)
	(= (distance city9 city1) 930)
	(= (distance city9 city2) 977)
	(= (distance city9 city3) 691)
	(= (distance city9 city4) 849)
	(= (distance city9 city5) 827)
	(= (distance city9 city6) 690)
	(= (distance city9 city7) 991)
	(= (distance city9 city8) 872)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at plane3 city8)
	(at person1 city8)
	(at person2 city7)
	(at person3 city6)
	(at person4 city1)
	(at person5 city9)
	(at person6 city3)
	))

(:metric minimize (+ (* 5 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (fly plane2 city2 city6)
   deleted: (at plane2 city2)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 0 to 2097, (fuel plane2) from 2520 to 423
   goals met: 0 of 8
2. (refuel plane1 city9)
   changed: (fuel plane1) from 2098 to 12108
   goals met: 0 of 8
3. (board person1 plane1 city9)
   deleted: (at person1 city9)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 8
4. (board person4 plane1 city9)
   deleted: (at person4 city9)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 8
5. (zoom plane1 city9 city3)
   deleted: (at plane1 city9)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 2097 to 8316, (fuel plane1) from 12108 to 5889
   goals met: 1 of 8
6. (refuel plane3 city3)
   changed: (fuel plane3) from 1030 to 5421
   goals met: 1 of 8
7. (zoom plane3 city3 city8)
   deleted: (at plane3 city3)
   added: (at plane3 city8)
   changed: (total-fuel-used) from 8316 to 13106, (fuel plane3) from 5421 to 631
   goals met: 2 of 8
8. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 13106 to 15410, (fuel plane1) from 5889 to 3585
   goals met: 1 of 8
9. (board person5 plane1 city0)
   deleted: (at person5 city0)
   added: (in person5 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 1 of 8
10. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 15410 to 17714, (fuel plane1) from 3585 to 1281
   goals met: 2 of 8
11. (refuel plane1 city3)
   changed: (fuel plane1) from 1281 to 12108
   goals met: 2 of 8
12. (fly plane1 city3 city8)
   deleted: (at plane1 city3)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 17714 to 21546, (fuel plane1) from 12108 to 8276
   goals met: 1 of 8
13. (debark person1 plane1 city8)
   deleted: (in person1 plane1)
   added: (at person1 city8)
   changed: (onboard plane1) from 3 to 2
   goals met: 2 of 8
14. (board person2 plane1 city8)
   deleted: (at person2 city8)
   added: (in person2 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 2 of 8
15. (fly plane1 city8 city7)
   deleted: (at plane1 city8)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 21546 to 24926, (fuel plane1) from 8276 to 4896
   goals met: 2 of 8
16. (debark person2 plane1 city7)
   deleted: (in person2 plane1)
   added: (at person2 city7)
   changed: (onboard plane1) from 3 to 2
   goals met: 3 of 8
17. (board person3 plane1 city7)
   deleted: (at person3 city7)
   added: (in person3 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 8
18. (board person6 plane1 city7)
   deleted: (at person6 city7)
   added: (in person6 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 3 of 8
19. (fly plane1 city7 city3)
   deleted: (at plane1 city7)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 24926 to 28326, (fuel plane1) from 4896 to 1496
   goals met: 4 of 8
20. (debark person6 plane1 city3)
   deleted: (in person6 plane1)
   added: (at person6 city3)
   changed: (onboard plane1) from 4 to 3
   goals met: 5 of 8
21. (refuel plane1 city3)
   changed: (fuel plane1) from 1496 to 12108
   goals met: 5 of 8
22. (fly plane1 city3 city6)
   deleted: (at plane1 city3)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 28326 to 31498, (fuel plane1) from 12108 to 8936
   goals met: 4 of 8
23. (debark person3 plane1 city6)
   deleted: (in person3 plane1)
   added: (at person3 city6)
   changed: (onboard plane1) from 3 to 2
   goals met: 5 of 8
24. (fly plane1 city6 city1)
   deleted: (at plane1 city6)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 31498 to 34222, (fuel plane1) from 8936 to 6212
   goals met: 5 of 8
25. (debark person4 plane1 city1)
   deleted: (in person4 plane1)
   added: (at person4 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 8
26. (fly plane1 city1 city9)
   deleted: (at plane1 city1)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 34222 to 37942, (fuel plane1) from 6212 to 2492
   goals met: 6 of 8
27. (debark person5 plane1 city9)
   deleted: (in person5 plane1)
   added: (at person5 city9)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 8
28. (refuel plane1 city9)
   changed: (fuel plane1) from 2492 to 12108
   goals met: 7 of 8
29. (zoom plane1 city9 city3)
   deleted: (at plane1 city9)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 37942 to 44161, (fuel plane1) from 12108 to 5889
   goals met: 8 of 8
